ktanino10/ai-hardware-engineering-team/firmware/bench-imu-01-rev5/evaluation/n8r8/sdkconfig.defaults
# N8R8 EVALUATION ONLY / NOT_FOR_FLASH. No baseline profile is replaced.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
# CONFIG_PM_ENABLE is not set
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Physical N8R8: 8 MB Quad flash and 8 MB Octal PSRAM (ESP-V11 comparison source).
# Select DIO/40 MHz flash. PSRAM remains excluded from the minimal component build.
# An image/configuration cannot establish the actual module suffix or memory.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_USB_CDC is not set
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
